{
  "rooms": [
    {
      "name": "Mountain footpath",
      "description": "You are on a path that hopefully leads to the Iron Mountain peak. \nThe terrain has a strange shade of yellow and it's covered of blue stones. \nTo the north, you see a big black forest. \nTo the south, your warm house. \nTo the east, there is the road for the port.\n",
      "items": [
        {
          "name": "terrain",
          "matchers": ["yellow terrain"],
          "grab": false,
          "description": "The terrain has a strange yellow shade... this place must have known magic."
        },
        {
          "name": "blue stones",
          "matchers": ["stones", "stone", "blue stone"],
          "grab": true,
          "description": "These strange blue stones... I don't know what they mean but they're kind of warm."
        }
      ],
      "NPCs": [
        {
          "name": "wizard",
          "description": "This is clearly a wizard... maybe he can help you.",
          "dialogue": [
            {
              "message": "Don't go to the port road... strange things happen there.",
              "responses": ["Ok then...", "Thanks, old man"]
            }
          ]
        }
      ],
      "connections": {
        "N": "Black forest",
        "S": "Your house",
        "E": "Port road",
        "W": null
      }
    },
    {
      "name": "Black forest",
      "description": "You suddenly feel that the temperature is dropping quickly. \nYou entered a big forest: everything is dark and cold, you can barely see your feet.\nAll around you, there are only trees and it seems like there is a small clearing to the west.",
      "items": [
        {
          "name": "trees",
          "matchers": ["tree", "big tree", "big trees"],
          "grab": false,
          "description": "These trees have something that freezes me up..."
        }
      ],
      "connections": {
        "N": null,
        "S": "Mountain footpath",
        "E": null,
        "W": null
      }
    },
    {
      "name": "Your house",
      "description": "Oh, this is your happy place. You live here with your wife and your 3 children, but you remember all this. \nThe house faces the north road: it leads to a mountain footpath.\n",
      "connections": {
        "N": "Mountain footpath",
        "S": null,
        "E": null,
        "W": null
      }
    },
    {
      "name": "Port road",
      "description": "You are walking down the main road that leads to the port. You have always been a little frightened by this road, you never really loved the sea. \nBut this time, you see something that catches your attention: a knife in the middle of the road.\n",
      "items": [
        {
          "name": "knife",
          "matchers": ["blade"],
          "grab": true,
          "description": "This is a sharp knife... it's still covered with blood."
        }
      ],
      "connections": {
        "N": null,
        "S": null,
        "E": null,
        "W": "Mountain footpath"
      }
    }
  ]
}